Revit 2027 API
FabricationConfigurationInfo.IsLocked Property
 Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLocked { get; }
Public ReadOnly Property IsLocked As Boolean
	Get
public:
property bool IsLocked {
	bool get ();
}
member IsLocked : bool with get
Property Value
Boolean
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace